Config/Catalogs/СпециальностиОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СпециальностиОбразование</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНаправлениеСпециальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьКлассификаторНаправленийИСпециальностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКвалификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьКвалификацииНаправленийИСпециальностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСпециальности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификацияСпециальности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КвалификацииОбразование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПоКлассификатору</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/СпециальностиОбразование/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗаполнитьКодИКвалификациюСпециальности() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпециальностиОбразование.Ссылка КАК Ссылка,
		|	СпециальностиОбразование.УдалитьНаправлениеСпециальность.Код КАК КодСпециальности,
		|	КвалификацииОбразование.Ссылка КАК КвалификацияСпециальности
		|ИЗ
		|	Справочник.СпециальностиОбразование КАК СпециальностиОбразование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КвалификацииОбразование КАК КвалификацииОбразование
		|		ПО СпециальностиОбразование.УдалитьКвалификация.Наименование = КвалификацииОбразование.Наименование
		|ГДЕ
		|	СпециальностиОбразование.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект(); // Справочник.СпециальностиОбразование
		СпрОбъект.КодСпециальности = Выборка.КодСпециальности;
		СпрОбъект.КвалификацияСпециальности = Выборка.КвалификацияСпециальности;
		
		СпрОбъект.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьНаименованиеПоКлассификатору() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпециальностиОбразование.Ссылка КАК Ссылка,
		|	СпециальностиОбразование.УдалитьНаправлениеСпециальность.Наименование КАК НаименованиеПоКлассификатору
		|ИЗ
		|	Справочник.СпециальностиОбразование КАК СпециальностиОбразование
		|ГДЕ
		|	СпециальностиОбразование.УдалитьНаправлениеСпециальность <> ЗНАЧЕНИЕ(Справочник.УдалитьКлассификаторНаправленийИСпециальностей.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект(); // Справочник.СпециальностиОбразование
		СпрОбъект.НаименованиеПоКлассификатору = Выборка.НаименованиеПоКлассификатору;
		
		СпрОбъект.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "Справочник.СпециальностиОбразование";
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			ПредставлениеОбъекта = Строка(Выборка.Ссылка);
			
			Блокировка = Новый БлокировкаДанных;
			Элемент = Блокировка.Добавить(ПолноеИмяОбъекта);
			Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Элемент.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			Объект = Выборка.Ссылка.ПолучитьОбъект(); // Справочник.СпециальностиОбразование
			ОбъектИзменен = Ложь;
			Если Объект <> Неопределено Тогда 
				Объект.Заблокировать();
				
				Объект.КодСпециальности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.УдалитьНаправлениеСпециальность, "Код");
				ОбъектИзменен = Истина;
			КонецЕсли;
				
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось записать документ: %Справочник% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Справочник%", ПредставлениеОбъекта);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Справочники.СпециальностиОбразование,
				Выборка.Ссылка,
				ТекстСообщения);
			ВызватьИсключение;
		
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
